import { DateMap } from './app.types';

export const DATE_SLIDES: DateMap = [
  {
    id: 0,
    dateStart: 2020,
    dateEnd: 2024,
    category: 'Наука',
    events: [
      {
        id: 0,
        year: '2020',
        text: ' Вакцинация против COVID-19. Несколько вакцин против коронавируса были разработаны и одобрены в рекордные сроки',
      },
      {
        id: 1,
        year: '2021',
        text: 'В феврале 2021 года NASA успешно приземлила свой марсоход Perseverance в кратере Езеро на Марсе',
      },
      {
        id: 2,
        year: '2022',
        text: 'В 2022 году команда Google Quantum AI заявила о своем прогрессе в разработке квантовых компьютеров',
      },
      {
        id: 3,
        year: '2022',
        text: 'В мае 2022 года команда ученых, опубликовала первое изображение черной дыры в центре нашей галактики',
      },
      {
        id: 4,
        year: '2023',
        text: 'В 2023 году исследователи объявили о значительном прогрессе в создании сверхпроводников при комнатной температуре.',
      },
    ],
  },
  {
    id: 1,
    dateStart: 2015,
    dateEnd: 2019,
    category: 'Кино',
    events: [
      {
        id: 0,
        year: '2015',
        text: 'В 2015 году компания Disney возродила культовую франшизу "Звездные войны" с фильмом "Пробуждение силы"',
      },
      {
        id: 1,
        year: '2016',
        text: 'В период с 2015 по 2019 год стриминговые сервисы, особенно Netflix, начали играть ведущую роль в киноиндустрии.',
      },
      {
        id: 2,
        year: '2018',
        text: 'В 2018 году вышел фильм "Черная Пантера" (Black Panther), который стал не только коммерческим хитом, но и культурным феноменом. ',
      },
      {
        id: 3,
        year: '2019',
        text: 'В 2019 году завершился один из самых популярных и влиятельных сериалов современности — "Игра престолов"',
      },
      {
        id: 4,
        year: '2019',
        text: 'В 2019 году вышел фильм "Мстители: Финал", который стал кульминацией десяти лет развития кинематографической вселенной Marvel',
      },
    ],
  },
  {
    id: 2,
    dateStart: 2010,
    dateEnd: 2014,
    category: 'Литература',
    events: [
      {
        id: 0,
        year: '2010',
        text: 'Жанр "Янг-эдалт" (Young Adult) (литература для подростков) пережил настоящий бум в начале 2010-х годов, благодаря таким книгам, как "Голодные игры"',
      },
      {
        id: 1,
        year: '2010',
        text: 'В 2010 году перуанский писатель и публицист Марио Варгас Льоса получил Нобелевскую премию по литературе',
      },
      {
        id: 2,
        year: '2011',
        text: 'Серия романов британской писательницы Э. Л. Джеймс стала мировым литературным феноменом после публикации в 2011 году.',
      },
      {
        id: 3,
        year: '2013',
        text: 'В 2013 году британская писательница Кейт Аткинсон опубликовала роман "Жизнь после жизни"',
      },
      {
        id: 4,
        year: '2013',
        text: 'В 2013 году канадская писательница Элис Манро была удостоена Нобелевской премии по литературе за свои достижения в жанре короткого рассказа.',
      },
    ],
  },
  {
    id: 3,
    dateStart: 2005,
    dateEnd: 2009,
    category: 'Спорт',
    events: [
      {
        id: 0,
        year: '2006',
        text: 'В 2006 году сборная Италии по футболу выиграла чемпионат мира',
      },
      {
        id: 1,
        year: '2008',
        text: 'В 2008 году сборная Испании по футболу выиграла чемпионат Европы, победив в финале сборную Германии со счетом 1:0.',
      },
      {
        id: 2,
        year: '2008',
        text: 'Ямайский спринтер Усейн Болт стал мировой сенсацией на Олимпийских играх в Пекине в 2008 году, выиграв золотые медали',
      },
      {
        id: 3,
        year: '2008',
        text: 'Финал Уимблдона 2008 года между Роджером Федерером и Рафаэлем Надалем стал одним из самых легендарных матчей в истории тенниса.',
      },
      {
        id: 4,
        year: '2009',
        text: 'В 2006 году семикратный чемпион мира Михаэль Шумахер завершил карьеру, но в 2009 году объявил о своем возвращении в Формулу-1 с командой Mercedes',
      },
    ],
  },
  {
    id: 4,
    dateStart: 2000,
    dateEnd: 2004,
    category: 'Наука',
    events: [
      {
        id: 0,
        year: '2000',
        text: 'В 2000 году астрономы подтвердили существование таинственной темной энергии, которая составляет около 70% энергии Вселенной',
      },
      {
        id: 1,
        year: '2003',
        text: 'В апреле 2003 года ученые объявили, что удалось полностью расшифровать последовательность человеческого генома.',
      },
      {
        id: 2,
        year: '2003',
        text: 'В 2003 году ученые впервые создали эмбрион-гибрид, состоящий из клеток человека и мыши.',
      },
      {
        id: 3,
        year: '2004',
        text: 'В 2004 году была открыта экзопланета Gliese 581 c, которая расположена в обитаемой зоне своей звезды.',
      },
      {
        id: 4,
        year: '2004',
        text: 'В 2003-2004 годах были проведены первые успешные испытания наночастиц для доставки лекарств к раковым клеткам.',
      },
    ],
  },
  {
    id: 5,
    dateStart: 1990,
    dateEnd: 1999,
    category: 'Литература',
    events: [
      {
        id: 0,
        year: '1990',
        text: 'В 1990-е годы продолжался рост популярности латиноамериканской литературы, благодаря таким писателям, как Альенде и Маркес.',
      },
      {
        id: 1,
        year: '1991',
        text: 'В 1991 году был опубликован роман "Американский психопат" Бретта Истона Эллиса, который вызвал огромные споры из-за своего жестокого содержания.',
      },
      {
        id: 2,
        year: '1993',
        text: 'В 1993 году Тони Моррисон стала первой афроамериканской женщиной, получившей Нобелевскую премию по литературе.',
      },
      {
        id: 3,
        year: '1995',
        text: 'В 1995 году Шеймус Хини, получил Нобелевскую премию по литературе за свою глубокую и насыщенную поэзию.',
      },
      {
        id: 4,
        year: '1997',
        text: 'В 1997 году британская писательница Дж. К. Роулинг выпустила первый роман из серии о юном волшебнике Гарри Поттере — "Гарри Поттер и философский камень"',
      },
    ],
  },
];
