export const DATE_SLIDES = [
  {
    id: 0,
    dateStart: '2015',
    dateEnd: '2022',
    events: [
      {
        id: 0,
        year: '2015',
        text: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
      },
      {
        id: 1,
        year: '2016',
        text: '16 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
      },
      {
        id: 2,
        year: '2017',
        text: '18 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
      },
      {
        id: 3,
        year: '2019',
        text: '19 cентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
      },
    ],
  },
  {
    id: 1,
    dateStart: '2000',
    dateEnd: '2010',
    events: [
      {
        id: 0,
        year: '2002',
        text: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
      },
      {
        id: 1,
        year: '2004',
        text: '16 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
      },
      {
        id: 2,
        year: '2008',
        text: '18 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
      },
      {
        id: 3,
        year: '2009',
        text: '19 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
      },
    ],
  },
  {
    id: 2,
    dateStart: '1990',
    dateEnd: '1999',
    events: [
      {
        id: 0,
        year: '1990',
        text: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
      },
      {
        id: 1,
        year: '1995',
        text: '16 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
      },
      {
        id: 2,
        year: '1998',
        text: '18 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
      },
      {
        id: 3,
        year: '1999',
        text: '19 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
      },
    ],
  },
];
